// Задача 64: Задайте значение N. Напишите программу, которая найдет факториал числа N рекурсивным методом.

// Console.Write("Input number: ");
// int Factorial(int n)
// {   
//     if(n == 1) return 1;
//     return n * Factorial(n - 1);
// }   

// int n = Convert.ToInt32(Console.ReadLine());
// Console.WriteLine($"Factorial of {n}! = {Factorial(n)}");


// Почему-то после 34 начинает выдавать ноль, а иногда отрицательное значение.


// ----------------------------------------------------------------------------------------------------------------------------------------------------------
// ----------------------------------------------------------------------------------------------------------------------------------------------------------



// Задача 66: Задайте значения M и N. Напишите программу, которая найдёт сумму натуральных элементов в промежутке от M до N.

// Console.Write("Add M: ");
// int numM = Convert.ToInt32(Console.ReadLine());


// Console.Write("Add N: ");
// int numN = Convert.ToInt32(Console.ReadLine());


// void SumRange(int numM, int numN, int sum)
//     {
//         if(numM > numN) 
//         {
//             Console.WriteLine($"Sum of elements from {numM} and {numN} is {sum}");
//             return;
//         }
//         sum = sum + (numM++);  
//         SumRange(numM, numN, sum);    
//     }

// SumRange(numM, numN, 0);

// ---------------------------------------------------------------------------------------------------------------------------------------------------------
// ---------------------------------------------------------------------------------------------------------------------------------------------------------
